Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0256GPM064.PIC
      <edc:SFRDef edc:_addr="0x1F802A80" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="RPINR7" edc:desc="" edc:impl="0x1f1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="RPINR7" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICM5R" edc:mask="0x1f" edc:name="ICM5R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ICM6R" edc:mask="0x1f" edc:name="ICM6R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ICM7R" edc:mask="0x1f" edc:name="ICM7R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ICM8R" edc:mask="0x1f" edc:name="ICM8R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802A90" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:access="---nnnnn-------------------nnnnn" edc:cname="RPINR8" edc:desc="" edc:impl="0x1f00001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000-------------------00000" edc:name="RPINR8" edc:nzwidth="32" edc:por="---00000-------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICM9R" edc:mask="0x1f" edc:name="ICM9R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="0x13"/>
            <edc:SFRFieldDef edc:cname="U3RXR" edc:mask="0x1f" edc:name="U3RXR" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802AA0" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:access="---nnnnn---nnnnn----------------" edc:cname="RPINR9" edc:desc="" edc:impl="0x1f1f0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000----------------" edc:name="RPINR9" edc:nzwidth="32" edc:por="---00000---00000----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="U2RXR" edc:mask="0x1f" edc:name="U2RXR" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="U2CTSR" edc:mask="0x1f" edc:name="U2CTSR" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802AB0" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:access="---nnnnn------------------------" edc:cname="RPINR10" edc:desc="" edc:impl="0x1f000000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000------------------------" edc:name="RPINR10" edc:nzwidth="32" edc:por="---00000------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="U3CTSR" edc:mask="0x1f" edc:name="U3CTSR" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802AC0" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:access="-----------nnnnn---nnnnn---nnnnn" edc:cname="RPINR11" edc:desc="" edc:impl="0x1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000---00000---00000" edc:name="RPINR11" edc:nzwidth="32" edc:por="-----------00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI2R" edc:desc="" edc:mask="0x1f" edc:name="SDI2R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SCK2INR" edc:desc="" edc:mask="0x1f" edc:name="SCK2INR" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SS2INR" edc:desc="" edc:mask="0x1f" edc:name="SS2INR" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802AD0" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:access="---nnnnn---nnnnn----------------" edc:cname="RPINR12" edc:desc="" edc:impl="0x1f1f0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000----------------" edc:name="RPINR12" edc:nzwidth="32" edc:por="---00000---00000----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="CLCINAR" edc:desc="" edc:mask="0x1f" edc:name="CLCINAR" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CLCINBR" edc:desc="" edc:mask="0x1f" edc:name="CLCINBR" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802AE0" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:offset="0x10"/>
      <edc:AdjustPoint edc:_addr="0x1F802AF0" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:offset="0x10"/>
      <edc:AdjustPoint edc:_addr="0x1F802B00" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F802B10" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="RPOR0" edc:desc="" edc:impl="0x1f1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="RPOR0" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RP1R" edc:desc="" edc:mask="0x1f" edc:name="RP1R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP2R" edc:desc="" edc:mask="0x1f" edc:name="RP2R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP3R" edc:desc="" edc:mask="0x1f" edc:name="RP3R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP4R" edc:desc="" edc:mask="0x1f" edc:name="RP4R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802B20" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="RPOR1" edc:desc="" edc:impl="0x1f1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="RPOR1" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RP5R" edc:desc="" edc:mask="0x1f" edc:name="RP5R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP6R" edc:desc="" edc:mask="0x1f" edc:name="RP6R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP7R" edc:desc="" edc:mask="0x1f" edc:name="RP7R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP8R" edc:desc="" edc:mask="0x1f" edc:name="RP8R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802B30" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="RPOR2" edc:desc="" edc:impl="0x1f1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="RPOR2" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RP9R" edc:desc="" edc:mask="0x1f" edc:name="RP9R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP10R" edc:desc="" edc:mask="0x1f" edc:name="RP10R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP11R" edc:desc="" edc:mask="0x1f" edc:name="RP11R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP12R" edc:desc="" edc:mask="0x1f" edc:name="RP12R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802B40" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="RPOR3" edc:desc="" edc:impl="0x1f1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="RPOR3" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RP13R" edc:desc="" edc:mask="0x1f" edc:name="RP13R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP14R" edc:desc="" edc:mask="0x1f" edc:name="RP14R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP15R" edc:desc="" edc:mask="0x1f" edc:name="RP15R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP16R" edc:desc="" edc:mask="0x1f" edc:name="RP16R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
