Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0256GPM064.PIC
      <edc:SFRDef edc:_addr="0x1F802DE0" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="LATC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="LATC" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATC0" edc:desc="" edc:mask="0x1" edc:name="LATC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC1" edc:desc="" edc:mask="0x1" edc:name="LATC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC2" edc:desc="" edc:mask="0x1" edc:name="LATC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC3" edc:desc="" edc:mask="0x1" edc:name="LATC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC4" edc:desc="" edc:mask="0x1" edc:name="LATC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC5" edc:desc="" edc:mask="0x1" edc:name="LATC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC6" edc:desc="" edc:mask="0x1" edc:name="LATC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC7" edc:desc="" edc:mask="0x1" edc:name="LATC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC8" edc:desc="" edc:mask="0x1" edc:name="LATC8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC9" edc:desc="" edc:mask="0x1" edc:name="LATC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC10" edc:desc="" edc:mask="0x1" edc:name="LATC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC11" edc:desc="" edc:mask="0x1" edc:name="LATC11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC12" edc:desc="" edc:mask="0x1" edc:name="LATC12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC13" edc:desc="" edc:mask="0x1" edc:name="LATC13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC14" edc:desc="" edc:mask="0x1" edc:name="LATC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC15" edc:desc="" edc:mask="0x1" edc:name="LATC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802DF0" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ODCC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="ODCC" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCC0" edc:desc="" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC1" edc:desc="" edc:mask="0x1" edc:name="ODCC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC2" edc:desc="" edc:mask="0x1" edc:name="ODCC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC3" edc:desc="" edc:mask="0x1" edc:name="ODCC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC4" edc:desc="" edc:mask="0x1" edc:name="ODCC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC5" edc:desc="" edc:mask="0x1" edc:name="ODCC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC6" edc:desc="" edc:mask="0x1" edc:name="ODCC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC7" edc:desc="" edc:mask="0x1" edc:name="ODCC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC8" edc:desc="" edc:mask="0x1" edc:name="ODCC8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC9" edc:desc="" edc:mask="0x1" edc:name="ODCC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC10" edc:desc="" edc:mask="0x1" edc:name="ODCC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC11" edc:desc="" edc:mask="0x1" edc:name="ODCC11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC12" edc:desc="" edc:mask="0x1" edc:name="ODCC12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC13" edc:desc="" edc:mask="0x1" edc:name="ODCC13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC14" edc:desc="" edc:mask="0x1" edc:name="ODCC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC15" edc:desc="" edc:mask="0x1" edc:name="ODCC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802E00" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPUC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNPUC" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUC0" edc:desc="" edc:mask="0x1" edc:name="CNPUC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC1" edc:desc="" edc:mask="0x1" edc:name="CNPUC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC2" edc:desc="" edc:mask="0x1" edc:name="CNPUC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC3" edc:desc="" edc:mask="0x1" edc:name="CNPUC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC4" edc:desc="" edc:mask="0x1" edc:name="CNPUC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC5" edc:desc="" edc:mask="0x1" edc:name="CNPUC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC6" edc:desc="" edc:mask="0x1" edc:name="CNPUC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC7" edc:desc="" edc:mask="0x1" edc:name="CNPUC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC8" edc:desc="" edc:mask="0x1" edc:name="CNPUC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC9" edc:desc="" edc:mask="0x1" edc:name="CNPUC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC10" edc:desc="" edc:mask="0x1" edc:name="CNPUC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC11" edc:desc="" edc:mask="0x1" edc:name="CNPUC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC12" edc:desc="" edc:mask="0x1" edc:name="CNPUC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC13" edc:desc="" edc:mask="0x1" edc:name="CNPUC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC14" edc:desc="" edc:mask="0x1" edc:name="CNPUC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC15" edc:desc="" edc:mask="0x1" edc:name="CNPUC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802E10" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPDC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNPDC" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDC0" edc:desc="" edc:mask="0x1" edc:name="CNPDC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC1" edc:desc="" edc:mask="0x1" edc:name="CNPDC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC2" edc:desc="" edc:mask="0x1" edc:name="CNPDC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC3" edc:desc="" edc:mask="0x1" edc:name="CNPDC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC4" edc:desc="" edc:mask="0x1" edc:name="CNPDC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC5" edc:desc="" edc:mask="0x1" edc:name="CNPDC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC6" edc:desc="" edc:mask="0x1" edc:name="CNPDC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC7" edc:desc="" edc:mask="0x1" edc:name="CNPDC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC8" edc:desc="" edc:mask="0x1" edc:name="CNPDC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC9" edc:desc="" edc:mask="0x1" edc:name="CNPDC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC10" edc:desc="" edc:mask="0x1" edc:name="CNPDC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC11" edc:desc="" edc:mask="0x1" edc:name="CNPDC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC12" edc:desc="" edc:mask="0x1" edc:name="CNPDC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC13" edc:desc="" edc:mask="0x1" edc:name="CNPDC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC14" edc:desc="" edc:mask="0x1" edc:name="CNPDC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC15" edc:desc="" edc:mask="0x1" edc:name="CNPDC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802E20" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nn--nn----------" edc:cname="CNCONC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffdfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00--00----------" edc:name="CNCONC" edc:nzwidth="0x20" edc:por="----------------00--00----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="10"/>
            <edc:SFRFieldDef edc:cname="PORT32" edc:desc="" edc:mask="0x1" edc:name="PORT32" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNSTYLE" edc:desc="" edc:mask="0x1" edc:name="CNSTYLE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802E30" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNEN0C" edc:desc="" edc:grp="PORTC" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNEN0C" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIE0C0" edc:desc="" edc:mask="0x1" edc:name="CNIE0C0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C1" edc:desc="" edc:mask="0x1" edc:name="CNIE0C1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C2" edc:desc="" edc:mask="0x1" edc:name="CNIE0C2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C3" edc:desc="" edc:mask="0x1" edc:name="CNIE0C3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C4" edc:desc="" edc:mask="0x1" edc:name="CNIE0C4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C5" edc:desc="" edc:mask="0x1" edc:name="CNIE0C5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C6" edc:desc="" edc:mask="0x1" edc:name="CNIE0C6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C7" edc:desc="" edc:mask="0x1" edc:name="CNIE0C7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C8" edc:desc="" edc:mask="0x1" edc:name="CNIE0C8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C9" edc:desc="" edc:mask="0x1" edc:name="CNIE0C9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C10" edc:desc="" edc:mask="0x1" edc:name="CNIE0C10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C11" edc:desc="" edc:mask="0x1" edc:name="CNIE0C11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C12" edc:desc="" edc:mask="0x1" edc:name="CNIE0C12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C13" edc:desc="" edc:mask="0x1" edc:name="CNIE0C13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C14" edc:desc="" edc:mask="0x1" edc:name="CNIE0C14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0C15" edc:desc="" edc:mask="0x1" edc:name="CNIE0C15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802E40" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNSTATC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="CNSTATC" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATC0" edc:desc="" edc:mask="0x1" edc:name="CNSTATC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC1" edc:desc="" edc:mask="0x1" edc:name="CNSTATC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC2" edc:desc="" edc:mask="0x1" edc:name="CNSTATC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC3" edc:desc="" edc:mask="0x1" edc:name="CNSTATC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC4" edc:desc="" edc:mask="0x1" edc:name="CNSTATC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC5" edc:desc="" edc:mask="0x1" edc:name="CNSTATC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC6" edc:desc="" edc:mask="0x1" edc:name="CNSTATC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC7" edc:desc="" edc:mask="0x1" edc:name="CNSTATC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC8" edc:desc="" edc:mask="0x1" edc:name="CNSTATC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC9" edc:desc="" edc:mask="0x1" edc:name="CNSTATC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC10" edc:desc="" edc:mask="0x1" edc:name="CNSTATC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC11" edc:desc="" edc:mask="0x1" edc:name="CNSTATC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC12" edc:desc="" edc:mask="0x1" edc:name="CNSTATC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC13" edc:desc="" edc:mask="0x1" edc:name="CNSTATC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC14" edc:desc="" edc:mask="0x1" edc:name="CNSTATC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC15" edc:desc="" edc:mask="0x1" edc:name="CNSTATC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802E50" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNEN1C" edc:desc="" edc:grp="PORTC" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNEN1C" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIE1C0" edc:desc="" edc:mask="0x1" edc:name="CNIE1C0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C1" edc:desc="" edc:mask="0x1" edc:name="CNIE1C1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C2" edc:desc="" edc:mask="0x1" edc:name="CNIE1C2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C3" edc:desc="" edc:mask="0x1" edc:name="CNIE1C3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C4" edc:desc="" edc:mask="0x1" edc:name="CNIE1C4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C5" edc:desc="" edc:mask="0x1" edc:name="CNIE1C5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C6" edc:desc="" edc:mask="0x1" edc:name="CNIE1C6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C7" edc:desc="" edc:mask="0x1" edc:name="CNIE1C7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C8" edc:desc="" edc:mask="0x1" edc:name="CNIE1C8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C9" edc:desc="" edc:mask="0x1" edc:name="CNIE1C9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C10" edc:desc="" edc:mask="0x1" edc:name="CNIE1C10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C11" edc:desc="" edc:mask="0x1" edc:name="CNIE1C11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C12" edc:desc="" edc:mask="0x1" edc:name="CNIE1C12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C13" edc:desc="" edc:mask="0x1" edc:name="CNIE1C13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C14" edc:desc="" edc:mask="0x1" edc:name="CNIE1C14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1C15" edc:desc="" edc:mask="0x1" edc:name="CNIE1C15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802E60" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNFC" edc:desc="" edc:grp="PORTC" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNFC" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFC0" edc:desc="" edc:mask="0x1" edc:name="CNFC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC1" edc:desc="" edc:mask="0x1" edc:name="CNFC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC2" edc:desc="" edc:mask="0x1" edc:name="CNFC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC3" edc:desc="" edc:mask="0x1" edc:name="CNFC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC4" edc:desc="" edc:mask="0x1" edc:name="CNFC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC5" edc:desc="" edc:mask="0x1" edc:name="CNFC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC6" edc:desc="" edc:mask="0x1" edc:name="CNFC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC7" edc:desc="" edc:mask="0x1" edc:name="CNFC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC8" edc:desc="" edc:mask="0x1" edc:name="CNFC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC9" edc:desc="" edc:mask="0x1" edc:name="CNFC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC10" edc:desc="" edc:mask="0x1" edc:name="CNFC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC11" edc:desc="" edc:mask="0x1" edc:name="CNFC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC12" edc:desc="" edc:mask="0x1" edc:name="CNFC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC13" edc:desc="" edc:mask="0x1" edc:name="CNFC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC14" edc:desc="" edc:mask="0x1" edc:name="CNFC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC15" edc:desc="" edc:mask="0x1" edc:name="CNFC15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
